//Задача 

//Какой результат будет у выражений ниже?

//Мои ответы

// "" + 1 + 0       10
// "" - 1 + 0       -1
// true + false     1
// 6 / "3"          2
// "2" * "3"        6
// 4 + 5 + "px"     45px  //9px
// "$" + 4 + 5      45$   // $45
// "4" - 2          2      
// "4px" - 2        4px-2  //NaN
// 7 / 0            infinity  
// "  -9  " + 5 4  // "-9  5"
// "  -9  " - 5    -14
// null + 1        null  //1 
// undefined + 1   und  //NaN
// " \t \n" - 2 0  // -2


//Правильные ответы

// "" + 1 + 0 = "10" 
// "" - 1 + 0 = -1 
// true + false = 1
// 6 / "3" = 2
// "2" * "3" = 6
// 4 + 5 + "px" = "9px"
// "$" + 4 + 5 = "$45"
// "4" - 2 = 2
// "4px" - 2 = NaN
// 7 / 0 = Infinity
// " -9  " + 5 = " -9  5" 
// " -9  " - 5 = -14 
// null + 1 = 1 
// undefined + 1 = NaN 
// " \t \n" - 2 = -2 